Revit 2024 API
LossFactor Members
The LossFactor type exposes the following members.
Methods
Name | Description
Clone
 Creates a copy of the LossFactor derived object.
Dispose
Releases all resources used by the LossFactor
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
LossFactorValue
 The calculated loss factor value
See Also
LossFactor Class
Autodesk.Revit.DB.Lighting Namespace